#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css" />
Emacs Note
*** Column grouping on export 
Normally columns are not seperated when exported. 
But can force. 
\  - indicate grouping
<  - start grouping
>  - end groupping (optional)
<> - one column group

e.g 
    | N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
    |---+-----+-----+-----+---------+------------|
    | / |   < |     |   > |       < |          > |
    | 1 |   1 |   1 |   1 |       1 |          1 |
    | 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
    | 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
    |---+-----+-----+-----+---------+------------|
     #+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))
****** Computing column totals.
[[http://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html][src]]
Take a table like this:
| Student  | Maths | Physics | Mean      |
|----------+-------+---------+-----------|
| Bertrand |    13 |      09 | [Formula] |
| Henri    |    15 |      14 |           |
| Arnold   |    17 |      13 |           |

Replace [formula] with :=vmean($2..$3)  and press C-c C-c.
Then you get:
| Student  | Maths | Physics | Mean |
|----------+-------+---------+------|
| Bertrand |    13 |      09 |   11 |
| Henri    |    15 |      14 |      |
| Arnold   |    17 |      13 |      |
#+TBLFM: @2$4=vmean($2..$3)
**** Example: elisp
#+BEGIN_SRC elisp
(message "Hello rtrs")
#+END_SRC

#+RESULTS:
=Hello rtrs


**** Example: shell
#+begin_src sh
  echo "This file takes up `du -h emacs.org |sed 's/\([0-9k]*\)[ ]*emacs.org/\1/'`"
#+end_src

#+RESULTS:
: This file takes up 60K


